Revit 2015 API
BoundarySegmentArrayArray Class
An array that contains boundary segment arrays.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public class BoundarySegmentArrayArray : APIObject,
	IEnumerable
Visual Basic
Public Class BoundarySegmentArrayArray _
	Inherits APIObject _
	Implements IEnumerable
Visual C++
public ref class BoundarySegmentArrayArray : public APIObject,
	IEnumerable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.BoundarySegmentArrayArray
See Also
BoundarySegmentArrayArray Members
Autodesk.Revit.DB Namespace